Tekla Open API Reference for Tekla Structures 2025
TextElement Class
 The TextElement class defines a user-defined text in a mark content.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.ElementBase
 Tekla.Structures.Drawing.TextElement
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class TextElement : ElementBase
<SerializableAttribute>
Public NotInheritable Class TextElement
	Inherits ElementBase
The TextElement type exposes the following members.
Constructors
Name | Description
TextElement(String)
 Creates a new text element instance with the given textual value.
TextElement(String, FontAttributes)
 Creates a new text element instance with the given textual value and font.
Top
Properties
Name | Description
Font
 The font of the text element.
Value
 The textual value of the text element.
Top
Methods
Name | Description
Clone
 Clones the object.
 (Overrides ElementBase.Clone().)
GetUnformattedString
 Returns the content as a string without formatting.
 (Overrides ElementBase.GetUnformattedString().)
IsEqual
 Compares the current object with an object of the same type.
 (Overrides ElementBase.IsEqual(Object).)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace